/*
*********************************************************************************************************
* 功  能：模块初始化
* 形  参：None
* 返回值：None
* 备  注：None
* 作  者：LG
* 日  期：2020/10/29
*********************************************************************************************************
*/

void setup()
{
    Serial.begin(115200);
}

/*
*********************************************************************************************************
* 功  能：循环调用
* 形  参：None
* 返回值：None
* 备  注：None
* 作  者：LG
* 日  期：2020/10/29
*********************************************************************************************************
*/

void loop()
{
    int8_t receive_data = 0;
    Serial.print("sent: ");
    Serial.print("hello,world");
    Serial.println();
    Serial.print("receive: ");
    receive_data = Serial.read();
    Serial.print(receive_data);
    Serial.println();
    delay(1000);
}
